---
title: "compiling problem edgy eft"
date: 2007-02-28
forum: Absolute Beginner Talk
---

### Post by DarkEye on 2007-02-28
Hi everyone,

I just installed Ubuntu "Edgy Eft" 6.10 on my laptop (pretty old one), but I can't get my wireless adapter to work. I tried to install ndiswrapper 1.37, put it on the laptop through my memory stick, but when i try to "make" it it shows this:

```
root@stef:/home/stef/Desktop/ndiswrapper-1.37# make
make -C driver
make[1]: Entering directory `/home/stef/Desktop/ndiswrapper-1.37/driver'
make -C /lib/modules/2.6.17-10-generic/build SUBDIRS=/home/stef/Desktop/ndiswrapper-1.37/driver
make[2]: Entering directory `/usr/src/linux-headers-2.6.17-10-generic'
  Building modules, stage 2.
  MODPOST
make[2]: Leaving directory `/usr/src/linux-headers-2.6.17-10-generic'
make[1]: Leaving directory `/home/stef/Desktop/ndiswrapper-1.37/driver'
make -C utils
make[1]: Entering directory `/home/stef/Desktop/ndiswrapper-1.37/utils'
gcc -g -Wall -I../driver -o loadndisdriver loadndisdriver.c
loadndisdriver.c:15:20: error: stdlib.h: No such file or directory
loadndisdriver.c:16:19: error: stdio.h: No such file or directory
loadndisdriver.c:17:19: error: errno.h: No such file or directory
loadndisdriver.c:18:20: error: string.h: No such file or directory
loadndisdriver.c:19:20: error: libgen.h: No such file or directory
loadndisdriver.c:21:22: error: sys/mman.h: No such file or directory
loadndisdriver.c:23:23: error: sys/types.h: No such file or directory
loadndisdriver.c:24:23: error: sys/ioctl.h: No such file or directory
loadndisdriver.c:25:22: error: sys/stat.h: No such file or directory
loadndisdriver.c:26:20: error: unistd.h: No such file or directory
loadndisdriver.c:27:19: error: fcntl.h: No such file or directory
In file included from /usr/lib/gcc/i486-linux-gnu/4.1.2/include/syslimits.h:7,
                 from /usr/lib/gcc/i486-linux-gnu/4.1.2/include/limits.h:11,
                 from loadndisdriver.c:28:
/usr/lib/gcc/i486-linux-gnu/4.1.2/include/limits.h:122:61: error: limits.h: No such file or directory
loadndisdriver.c:29:19: error: ctype.h: No such file or directory
loadndisdriver.c:30:20: error: dirent.h: No such file or directory
loadndisdriver.c:31:20: error: syslog.h: No such file or directory
loadndisdriver.c:34:25: error: linux/major.h: No such file or directory
loadndisdriver.c:35:25: error: linux/ioctl.h: No such file or directory
In file included from loadndisdriver.c:37:
../driver/loader.h:24: error: expected specifier-qualifier-list before Гўв‚¬Лњsize_tГўв‚¬в„ў
loadndisdriver.c: In function Гўв‚¬Лњload_fileГўв‚¬в„ў:
loadndisdriver.c:67: error: Гўв‚¬Лњsize_tГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:67: error: (Each undeclared identifier is reported only once
loadndisdriver.c:67: error: for each function it appears in.)
loadndisdriver.c:67: error: expected Гўв‚¬Лњ;Гўв‚¬в„ў before Гўв‚¬ЛњsizeГўв‚¬в„ў
loadndisdriver.c:68: error: Гўв‚¬ЛњNULLГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:69: error: storage size of Гўв‚¬ЛњstatbufГўв‚¬в„ў isnГўв‚¬в„ўt known
loadndisdriver.c:71: warning: implicit declaration of function Гўв‚¬ЛњbasenameГўв‚¬в„ў
loadndisdriver.c:71: warning: initialization makes pointer from integer without a cast
loadndisdriver.c:73: warning: implicit declaration of function Гўв‚¬ЛњopenГўв‚¬в„ў
loadndisdriver.c:73: error: Гўв‚¬ЛњO_RDONLYГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:75: warning: implicit declaration of function Гўв‚¬ЛњsyslogГўв‚¬в„ў
loadndisdriver.c:75: error: Гўв‚¬ЛњLOG_KERNГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:75: error: Гўв‚¬ЛњLOG_INFOГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:75: warning: implicit declaration of function Гўв‚¬ЛњstrerrorГўв‚¬в„ў
loadndisdriver.c:75: error: Гўв‚¬ЛњerrnoГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:76: error: Гўв‚¬ЛњEINVALГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:79: warning: implicit declaration of function Гўв‚¬ЛњfstatГўв‚¬в„ў
loadndisdriver.c:81: warning: implicit declaration of function Гўв‚¬ЛњcloseГўв‚¬в„ў
loadndisdriver.c:84: error: Гўв‚¬ЛњsizeГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:86: warning: implicit declaration of function Гўв‚¬ЛњmmapГўв‚¬в„ў
loadndisdriver.c:86: error: Гўв‚¬ЛњPROT_READГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:86: error: Гўв‚¬ЛњMAP_PRIVATEГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:86: warning: assignment makes pointer from integer without a cast
loadndisdriver.c:87: error: Гўв‚¬ЛњMAP_FAILEDГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:93: warning: implicit declaration of function Гўв‚¬ЛњstrncpyГўв‚¬в„ў
loadndisdriver.c:93: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњstrncpyГўв‚¬в„ў
loadndisdriver.c:95: error: Гўв‚¬Лњstruct load_driver_fileГўв‚¬в„ў has no member named Гўв‚¬ЛњsizeГўв‚¬в„ў
loadndisdriver.c:96: error: Гўв‚¬Лњstruct load_driver_fileГўв‚¬в„ў has no member named Гўв‚¬ЛњdataГўв‚¬в„ў
loadndisdriver.c:69: warning: unused variable Гўв‚¬ЛњstatbufГўв‚¬в„ў
loadndisdriver.c: In function Гўв‚¬Лњparse_setting_lineГўв‚¬в„ў:
loadndisdriver.c:109: warning: implicit declaration of function Гўв‚¬ЛњisspaceГўв‚¬в„ў
loadndisdriver.c:115: warning: implicit declaration of function Гўв‚¬ЛњstrchrГўв‚¬в„ў
loadndisdriver.c:115: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњstrchrГўв‚¬в„ў
loadndisdriver.c:115: error: Гўв‚¬ЛњNULLГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:117: error: Гўв‚¬ЛњLOG_KERNГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:117: error: Гўв‚¬ЛњLOG_INFOГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:118: error: Гўв‚¬ЛњEINVALГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:138: warning: implicit declaration of function Гўв‚¬ЛњstrlenГўв‚¬в„ў
loadndisdriver.c:138: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњstrlenГўв‚¬в„ў
loadndisdriver.c: In function Гўв‚¬Лњread_conf_fileГўв‚¬в„ў:
loadndisdriver.c:150: error: storage size of Гўв‚¬ЛњstatbufГўв‚¬в„ў isnГўв‚¬в„ўt known
loadndisdriver.c:151: error: Гўв‚¬ЛњFILEГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:151: error: Гўв‚¬ЛњconfigГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:157: warning: implicit declaration of function Гўв‚¬ЛњlstatГўв‚¬в„ў
loadndisdriver.c:158: error: Гўв‚¬ЛњLOG_KERNГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:158: error: Гўв‚¬ЛњLOG_INFOГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:158: error: Гўв‚¬ЛњerrnoГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:160: error: Гўв‚¬ЛњEINVALГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:163: warning: implicit declaration of function Гўв‚¬ЛњsscanfГўв‚¬в„ў
loadndisdriver.c:163: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњsscanfГўв‚¬в„ў
loadndisdriver.c:179: warning: implicit declaration of function Гўв‚¬ЛњfopenГўв‚¬в„ў
loadndisdriver.c:179: error: Гўв‚¬ЛњNULLГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:183: warning: implicit declaration of function Гўв‚¬ЛњfgetsГўв‚¬в„ў
loadndisdriver.c:195: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњstrncpyГўв‚¬в„ў
loadndisdriver.c:206: warning: implicit declaration of function Гўв‚¬ЛњfcloseГўв‚¬в„ў
loadndisdriver.c:150: warning: unused variable Гўв‚¬ЛњstatbufГўв‚¬в„ў
loadndisdriver.c: In function Гўв‚¬Лњload_bin_fileГўв‚¬в„ў:
loadndisdriver.c:218: error: Гўв‚¬ЛњLOG_KERNГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:218: error: Гўв‚¬ЛњLOG_INFOГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:220: warning: implicit declaration of function Гўв‚¬ЛњtolowerГўв‚¬в„ў
loadndisdriver.c:222: warning: implicit declaration of function Гўв‚¬ЛњchdirГўв‚¬в„ў
loadndisdriver.c:223: error: Гўв‚¬ЛњerrnoГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:225: error: Гўв‚¬ЛњEINVALГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:231: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњstrncpyГўв‚¬в„ў
loadndisdriver.c:233: warning: implicit declaration of function Гўв‚¬ЛњioctlГўв‚¬в„ў
loadndisdriver.c:233: warning: implicit declaration of function Гўв‚¬Лњ_IOWГўв‚¬в„ў
loadndisdriver.c:233: error: expected expression before Гўв‚¬ЛњstructГўв‚¬в„ў
loadndisdriver.c: In function Гўв‚¬Лњload_driverГўв‚¬в„ў:
loadndisdriver.c:250: error: Гўв‚¬ЛњDIRГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:250: error: Гўв‚¬Лњdriver_dirГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:252: error: Гўв‚¬ЛњNULLГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:256: error: Гўв‚¬ЛњLOG_KERNГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:256: error: Гўв‚¬ЛњLOG_INFOГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:258: error: Гўв‚¬ЛњerrnoГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:260: error: Гўв‚¬ЛњEINVALГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:262: warning: implicit declaration of function Гўв‚¬ЛњopendirГўв‚¬в„ў
loadndisdriver.c:268: warning: implicit declaration of function Гўв‚¬ЛњmallocГўв‚¬в„ў
loadndisdriver.c:268: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњmallocГўв‚¬в„ў
loadndisdriver.c:272: warning: implicit declaration of function Гўв‚¬ЛњmemsetГўв‚¬в„ў
loadndisdriver.c:272: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњmemsetГўв‚¬в„ў
loadndisdriver.c:273: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњstrncpyГўв‚¬в„ў
loadndisdriver.c:281: warning: implicit declaration of function Гўв‚¬ЛњreaddirГўв‚¬в„ў
loadndisdriver.c:281: warning: assignment makes pointer from integer without a cast
loadndisdriver.c:283: error: storage size of Гўв‚¬ЛњstatbufГўв‚¬в„ў isnГўв‚¬в„ўt known
loadndisdriver.c:285: error: dereferencing pointer to incomplete type
loadndisdriver.c:288: warning: implicit declaration of function Гўв‚¬ЛњstatГўв‚¬в„ў
loadndisdriver.c:288: error: dereferencing pointer to incomplete type
loadndisdriver.c:289: warning: implicit declaration of function Гўв‚¬ЛњS_ISREGГўв‚¬в„ў
loadndisdriver.c:290: error: dereferencing pointer to incomplete type
loadndisdriver.c:295: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњstrlenГўв‚¬в„ў
loadndisdriver.c:295: error: dereferencing pointer to incomplete type
loadndisdriver.c:297: warning: implicit declaration of function Гўв‚¬ЛњstrcasecmpГўв‚¬в„ў
loadndisdriver.c:297: error: dereferencing pointer to incomplete type
loadndisdriver.c:300: error: dereferencing pointer to incomplete type
loadndisdriver.c:303: error: dereferencing pointer to incomplete type
loadndisdriver.c:304: error: dereferencing pointer to incomplete type
loadndisdriver.c:306: error: dereferencing pointer to incomplete type
loadndisdriver.c:312: error: dereferencing pointer to incomplete type
loadndisdriver.c:313: error: dereferencing pointer to incomplete type
loadndisdriver.c:314: warning: implicit declaration of function Гўв‚¬ЛњstrcpyГўв‚¬в„ў
loadndisdriver.c:314: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњstrcpyГўв‚¬в„ў
loadndisdriver.c:315: error: dereferencing pointer to incomplete type
loadndisdriver.c:318: error: Гўв‚¬Лњstruct load_driver_fileГўв‚¬в„ў has no member named Гўв‚¬ЛњsizeГўв‚¬в„ў
loadndisdriver.c:319: error: Гўв‚¬Лњstruct load_driver_fileГўв‚¬в„ў has no member named Гўв‚¬ЛњdataГўв‚¬в„ў
loadndisdriver.c:322: error: dereferencing pointer to incomplete type
loadndisdriver.c:283: warning: unused variable Гўв‚¬ЛњstatbufГўв‚¬в„ў
loadndisdriver.c:345: error: expected expression before Гўв‚¬ЛњstructГўв‚¬в„ў
loadndisdriver.c:347: warning: implicit declaration of function Гўв‚¬ЛњclosedirГўв‚¬в„ў
loadndisdriver.c:349: warning: implicit declaration of function Гўв‚¬ЛњfreeГўв‚¬в„ў
loadndisdriver.c:356: warning: implicit declaration of function Гўв‚¬ЛњmunmapГўв‚¬в„ў
loadndisdriver.c:356: error: Гўв‚¬Лњstruct load_driver_fileГўв‚¬в„ў has no member named Гўв‚¬ЛњdataГўв‚¬в„ў
loadndisdriver.c:356: error: Гўв‚¬Лњstruct load_driver_fileГўв‚¬в„ў has no member named Гўв‚¬ЛњsizeГўв‚¬в„ў
loadndisdriver.c:358: error: Гўв‚¬Лњstruct load_driver_fileГўв‚¬в„ў has no member named Гўв‚¬ЛњdataГўв‚¬в„ў
loadndisdriver.c:358: error: Гўв‚¬Лњstruct load_driver_fileГўв‚¬в„ў has no member named Гўв‚¬ЛњsizeГўв‚¬в„ў
loadndisdriver.c: In function Гўв‚¬Лњget_deviceГўв‚¬в„ў:
loadndisdriver.c:368: error: storage size of Гўв‚¬ЛњstatbufГўв‚¬в„ў isnГўв‚¬в„ўt known
loadndisdriver.c:371: error: Гўв‚¬ЛњLOG_KERNГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:371: error: Гўв‚¬ЛњLOG_INFOГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:374: error: Гўв‚¬ЛњerrnoГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:375: error: Гўв‚¬ЛњEINVALГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:377: warning: implicit declaration of function Гўв‚¬ЛњsnprintfГўв‚¬в„ў
loadndisdriver.c:377: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњsnprintfГўв‚¬в„ў
loadndisdriver.c:408: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњstrncpyГўв‚¬в„ў
loadndisdriver.c:368: warning: unused variable Гўв‚¬ЛњstatbufГўв‚¬в„ў
loadndisdriver.c: In function Гўв‚¬Лњload_deviceГўв‚¬в„ў:
loadndisdriver.c:420: error: Гўв‚¬ЛњDIRГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:420: error: Гўв‚¬ЛњdirГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:424: error: Гўв‚¬ЛњLOG_KERNГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:424: error: Гўв‚¬ЛњLOG_INFOГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:425: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњmemsetГўв‚¬в„ў
loadndisdriver.c:427: error: Гўв‚¬ЛњerrnoГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:428: error: Гўв‚¬ЛњEINVALГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:430: error: Гўв‚¬ЛњNULLГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:435: warning: assignment makes pointer from integer without a cast
loadndisdriver.c:436: error: dereferencing pointer to incomplete type
loadndisdriver.c:437: error: dereferencing pointer to incomplete type
loadndisdriver.c:440: error: dereferencing pointer to incomplete type
loadndisdriver.c:449: error: expected expression before Гўв‚¬ЛњstructГўв‚¬в„ў
loadndisdriver.c: In function Гўв‚¬Лњget_ioctl_deviceГўв‚¬в„ў:
loadndisdriver.c:466: error: Гўв‚¬ЛњFILEГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:466: error: Гўв‚¬Лњproc_miscГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:474: warning: implicit declaration of function Гўв‚¬ЛњstrstrГўв‚¬в„ў
loadndisdriver.c:474: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњstrstrГўв‚¬в„ў
loadndisdriver.c:475: warning: implicit declaration of function Гўв‚¬ЛњstrtolГўв‚¬в„ў
loadndisdriver.c:475: error: Гўв‚¬ЛњNULLГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:485: error: Гўв‚¬ЛњLOG_KERNГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:485: error: Гўв‚¬ЛњLOG_INFOГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:490: warning: implicit declaration of function Гўв‚¬ЛњunlinkГўв‚¬в„ў
loadndisdriver.c:491: warning: implicit declaration of function Гўв‚¬ЛњmknodГўв‚¬в„ў
loadndisdriver.c:491: error: Гўв‚¬ЛњS_IFCHRГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:491: error: Гўв‚¬ЛњMISC_MAJORГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:492: error: Гўв‚¬ЛњerrnoГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:497: error: Гўв‚¬ЛњO_RDONLYГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c: In function Гўв‚¬ЛњmainГўв‚¬в„ў:
loadndisdriver.c:513: warning: implicit declaration of function Гўв‚¬ЛњopenlogГўв‚¬в„ў
loadndisdriver.c:513: error: Гўв‚¬ЛњLOG_PERRORГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:513: error: Гўв‚¬ЛњLOG_CONSГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:513: error: Гўв‚¬ЛњLOG_KERNГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:513: error: Гўв‚¬ЛњLOG_DEBUGГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:515: error: Гўв‚¬ЛњLOG_INFOГўв‚¬в„ў undeclared (first use in this function)
loadndisdriver.c:517: warning: implicit declaration of function Гўв‚¬ЛњstrncmpГўв‚¬в„ў
loadndisdriver.c:519: warning: implicit declaration of function Гўв‚¬ЛњprintfГўв‚¬в„ў
loadndisdriver.c:519: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњprintfГўв‚¬в„ў
loadndisdriver.c:529: warning: implicit declaration of function Гўв‚¬ЛњatoiГўв‚¬в„ў
loadndisdriver.c:544: warning: implicit declaration of function Гўв‚¬ЛњatofГўв‚¬в„ў
loadndisdriver.c:551: warning: implicit declaration of function Гўв‚¬ЛњstrcmpГўв‚¬в„ў
loadndisdriver.c:558: warning: incompatible implicit declaration of built-in function Гўв‚¬ЛњsscanfГўв‚¬в„ў
loadndisdriver.c:592: warning: implicit declaration of function Гўв‚¬ЛњcloselogГўв‚¬в„ў
make[1]: *** [loadndisdriver] Error 1
make[1]: Leaving directory `/home/stef/Desktop/ndiswrapper-1.37/utils'
make: *** [all] Error 2

```

I searched about this problem online, and I found several threads showing that I might be missing the libc6-dev library ... I tried to download it from multiple sources but it always showed "dependency problem with libc6" so I'm stuck now...

I also read in many places something about build-essential, but I'm really stuck now and any help is welcome :)

thanks in advance,


-DarkEye

---

### Post by DarkEye on 2007-02-28
up...anyone ? this is starting to annoy me :(

---

### Post by zvacet on 2007-02-28
To build-essential
```
sudo aptitude install build-essential
```
and for libc6-dev in firefox search engine find ubuntu packages and type libc6-dev
I hope it helps.

---

### Post by koconnor100 on 2007-02-28
yer basic ubuntu 6.10 has a lot of bugs in it, including that the compiler don't work. 

You ahve to get that ubuntu patch to fix all that up. "easyubuntu" it's called. 

[https://launchpad.net/easyubuntu](https://launchpad.net/easyubuntu)

(edit)
this sticks an option on your applications / system tools menu called easy ubuntu , launch it and just click on all the patches you want. You want pretty much all of it (well...if your video drivers arn't Nvidea you probably don't want the nvidea patch...use common sense)

---

